In [ ]:
import pandas as pd
import numpy as np
import warnings

In [ ]:
warnings.filterwarnings("ignore")

In [ ]:
data=pd.read_csv(r"/content/u.data",sep="\t",names=["user_id","item_id","rating","timestamp"])

In [ ]:
data.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [ ]:
data.shape

(100000, 4)

In [ ]:
data["user_id"].nunique()

943

In [ ]:
data["item_id"].nunique()

1682

In [ ]:
moveis_title=pd.read_csv(r"/content/u.item",sep="\|",header=None)

In [ ]:
moveis_title.head()

   0                  1            2   3   ... 20  21  22  23
0   1   Toy Story (1995)  01-Jan-1995 NaN  ...  0   0   0   0
1   2   GoldenEye (1995)  01-Jan-1995 NaN  ...  0   1   0   0
2   3  Four Rooms (1995)  01-Jan-1995 NaN  ...  0   1   0   0
3   4  Get Shorty (1995)  01-Jan-1995 NaN  ...  0   0   0   0
4   5     Copycat (1995)  01-Jan-1995 NaN  ...  0   1   0   0

[5 rows x 24 columns]

In [ ]:
moveis_title=moveis_title[[0,1]]

In [ ]:
moveis_title.head()

   0                  1
0  1   Toy Story (1995)
1  2   GoldenEye (1995)
2  3  Four Rooms (1995)
3  4  Get Shorty (1995)
4  5     Copycat (1995)

In [ ]:
moveis_title.columns=["item_id","title"]

In [ ]:
moveis_title.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [ ]:
moveis_title.ndim

2

In [ ]:
df=pd.merge(data,moveis_title,on="item_id")

In [ ]:
df.head()

   user_id  item_id  rating  timestamp         title
0      196      242       3  881250949  Kolya (1996)
1       63      242       3  875747190  Kolya (1996)
2      226      242       5  883888671  Kolya (1996)
3      154      242       3  879138235  Kolya (1996)
4      306      242       5  876503793  Kolya (1996)

In [ ]:
df.tail(10)

       user_id  ...                                              title
99990      416  ...                                     Everest (1998)
99991      648  ...         Nobody Loves Me (Keiner liebt mich) (1994)
99992      655  ...                            Butcher Boy, The (1998)
99993      747  ...                    Getting Away With Murder (1996)
99994      916  ...          Scream of Stone (Schrei aus Stein) (1991)
99995      840  ...                                  Mamma Roma (1962)
99996      655  ...                             Eighth Day, The (1996)
99997      655  ...                                  Girls Town (1996)
99998      655  ...  Silence of the Palace, The (Saimt el Qusur) (1...
99999      655  ...                                    Dadetown (1995)

[10 rows x 5 columns]

In [ ]:
rating=pd.DataFrame(df.groupby("title").mean()["rating"])

In [ ]:
rating.head()

                             rating
title
'Til There Was You (1997)  2.333333
1-900 (1994)               2.600000
101 Dalmatians (1996)      2.908257
12 Angry Men (1957)        4.344000
187 (1997)                 3.024390

In [ ]:
rating["num_of_rating"]=pd.DataFrame(df.groupby("title").count()["rating"])

In [ ]:
rating["num_of_rating"].head()

title
'Til There Was You (1997)      9
1-900 (1994)                   5
101 Dalmatians (1996)        109
12 Angry Men (1957)          125
187 (1997)                    41
Name: num_of_rating, dtype: int64

In [ ]:
moveimat=df.pivot_table(index="user_id",columns="title",values="rating")

In [ ]:
moveimat.head()

title    'Til There Was You (1997)  ...  � k�ldum klaka (Cold Fever) (1994)
user_id                             ...
1                              NaN  ...                                 NaN
2                              NaN  ...                                 NaN
3                              NaN  ...                                 NaN
4                              NaN  ...                                 NaN
5                              NaN  ...                                 NaN

[5 rows x 1664 columns]

In [ ]:
til_there_was_you=moveimat["'Til There Was You (1997)"]

In [ ]:
til_there_was_you.head()

user_id
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: 'Til There Was You (1997), dtype: float64

In [ ]:
siml_til_there_was_you=moveimat.corrwith(til_there_was_you)

In [ ]:
siml_til_there_was_you.head(10)

title
'Til There Was You (1997)                      1.000000
1-900 (1994)                                        NaN
101 Dalmatians (1996)                         -1.000000
12 Angry Men (1957)                           -0.500000
187 (1997)                                    -0.500000
2 Days in the Valley (1996)                    0.522233
20,000 Leagues Under the Sea (1954)                 NaN
2001: A Space Odyssey (1968)                  -0.426401
3 Ninjas: High Noon At Mega Mountain (1998)         NaN
39 Steps, The (1935)                                NaN
dtype: float64

In [ ]:
corre_till_there_was_you=pd.DataFrame(data=siml_til_there_was_you,columns=["correlation"])

In [ ]:
corre_till_there_was_you.head()

                           correlation
title
'Til There Was You (1997)          1.0
1-900 (1994)                       NaN
101 Dalmatians (1996)             -1.0
12 Angry Men (1957)               -0.5
187 (1997)                        -0.5

In [ ]:
corre_till_there_was_you.dropna(inplace=True)

In [ ]:
corre_till_there_was_you.head()

                             correlation
title
'Til There Was You (1997)       1.000000
101 Dalmatians (1996)          -1.000000
12 Angry Men (1957)            -0.500000
187 (1997)                     -0.500000
2 Days in the Valley (1996)     0.522233

In [ ]:
corre_till_there_was_you.sort_values("correlation",ascending=False)

                                           correlation
title
'Til There Was You (1997)                          1.0
Rear Window (1954)                                 1.0
Indiana Jones and the Last Crusade (1989)          1.0
Immortal Beloved (1994)                            1.0
Bean (1997)                                        1.0
...                                                ...
Secrets & Lies (1996)                             -1.0
Apt Pupil (1998)                                  -1.0
Remains of the Day, The (1993)                    -1.0
Spawn (1997)                                      -1.0
True Romance (1993)                               -1.0

[341 rows x 1 columns]

In [ ]:
rating.head()

                             rating  num_of_rating
title
'Til There Was You (1997)  2.333333              9
1-900 (1994)               2.600000              5
101 Dalmatians (1996)      2.908257            109
12 Angry Men (1957)        4.344000            125
187 (1997)                 3.024390             41

In [ ]:
corre_till_there_was_you=corre_till_there_was_you.join(rating["num_of_rating"])

In [ ]:
corre_till_there_was_you.head()

                             correlation  num_of_rating
title
'Til There Was You (1997)       1.000000              9
101 Dalmatians (1996)          -1.000000            109
12 Angry Men (1957)            -0.500000            125
187 (1997)                     -0.500000             41
2 Days in the Valley (1996)     0.522233             93

In [ ]:
X=corre_till_there_was_you[corre_till_there_was_you["num_of_rating"]>100]

In [ ]:
X.sort_values("correlation",ascending=False)

                                               correlation  num_of_rating
title
Beautiful Girls (1996)                                 1.0            115
Edge, The (1997)                                       1.0            113
William Shakespeare's Romeo and Juliet (1996)          1.0            106
Star Trek: The Wrath of Khan (1982)                    1.0            244
Dumbo (1941)                                           1.0            123
...                                                    ...            ...
Spawn (1997)                                          -1.0            143
Remains of the Day, The (1993)                        -1.0            150
True Romance (1993)                                   -1.0            104
Secrets & Lies (1996)                                 -1.0            162
Apt Pupil (1998)                                      -1.0            160

[219 rows x 2 columns]

In [ ]:
corre_till_there_was_you.head()

                             correlation  num_of_rating
title
'Til There Was You (1997)       1.000000              9
101 Dalmatians (1996)          -1.000000            109
12 Angry Men (1957)            -0.500000            125
187 (1997)                     -0.500000             41
2 Days in the Valley (1996)     0.522233             93

In [ ]:
def predict_moveis(movei):
  movei_rating=moveimat[movei]
  siml_movei=moveimat.corrwith(movei_rating)
  corr_siml_movei=pd.DataFrame(data=siml_movei,columns=["correlation"])
  corr_siml_movei.dropna(inplace=True)
  corr_siml_movei.sort_values("correlation",ascending=False)
  corr_siml_movei=corr_siml_movei.join(rating["num_of_rating"])
  X1=corr_siml_movei[corr_siml_movei["num_of_rating"]>100]
  prediction=X1.sort_values("correlation",ascending=False)
  return prediction

In [ ]:
predict_moveis("12 Angry Men (1957)").head()

                             correlation  num_of_rating
title
12 Angry Men (1957)             1.000000            125
Ulee's Gold (1997)              0.619544            184
Rear Window (1954)              0.570513            209
Seven Years in Tibet (1997)     0.549939            155
Clerks (1994)                   0.528173            148

In [ ]:
predict_moveis("Star Wars (1977)").head()

                                                    correlation  num_of_rating
title
Star Wars (1977)                                       1.000000            583
Empire Strikes Back, The (1980)                        0.747981            367
Return of the Jedi (1983)                              0.672556            507
Raiders of the Lost Ark (1981)                         0.536117            420
Austin Powers: International Man of Mystery (1997)     0.377433            130